tutorials/simpleFoam/crossFlowTurbine/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuatorDisk
/*
    {
        name 	actuatorDisk;
        type	cellSet;
        action	new;
        source	boxToCell;
        sourceInfo
        {
            box (-0.5 -0.5 -0.5) (0.5 0.5 0.5)
        }
    }
*/
    {
        name 	actuatorDisk;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
            p1 (0 0 -0.5); 
            p2 (0 0 0.5); 
            radius 0.5;
        }
    }

    {
        name    actuatorDisk;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuatorDisk;
        }
    }
/*
    // actuationDisk1
    {
        name    actuationDisk1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (581850.5 4785805 1061) (581850.8 4785815 1071);
        }
    }
    {
        name    actuationDisk1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuationDisk1;
        }
    }
    // actuationDisk2
    {
        name    actuationDisk2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (581754 4785658 1065) (581754.4 4785668 1075);
        }
    }
    {
        name    actuationDisk2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuationDisk2;
        }
    }
*/
);

// ************************************************************************* //
